tests/benchmark/http_v2.yaml
config:
  target: "{{ $processEnvironment.LISK_SERVICE_URL }}/v2"
  http: 
    timeout: 10
  phases:
    - duration: 15
      arrivalRate: 60
      name: "Sustained max load of 60 users for 15 seconds"
  defaults:
    headers:
      content-type: "application/json"
scenarios:
  - name: "Transactions"
    flow:
      - get:
          url: "/transactions"
          qs:
            limit: 20
          expect:
            - statusCode: 200
      - get:
          url: "/transactions"
          qs:
            limit: 30
          expect:
            - statusCode: 200
  - name: "Blocks"
    flow:
      - get:
          url: "/blocks"
          qs:
            limit: 20
          expect:
            - statusCode: 200
      - get:
          url: "/blocks"
          qs:
            limit: 30
          expect:
            - statusCode: 200
      - get:
          url: "/blocsks"
          qs:
            limit: 100
          expect:
            - statusCode: 200
  - name: "Accounts"
    flow:
      - get:
          url: "/accounts"
          qs:
            limit: 20
          expect:
            - statusCode: 200
      - get:
          url: "/accounts"
          qs:
            limit: 30
          expect:
            - statusCode: 200
  - name: "Delegates"
    flow:
      - get:
          url: "/accounts"
          qs:
            limit: 20
            isDelegate: true
          expect:
            - statusCode: 200
      - get:
          url: "/accounts"
          qs:
            limit: 103
            isDelegate: true
          expect:
            - statusCode: 200