tests/benchmark/http_v2.yaml
config:
  target: "http://localhost:9901/api/v2"
  http: 
    timeout: 10
  phases:
    - duration: 15
      arrivalRate: 60
      name: "Sustained max load of 60 users for 15 seconds"
  defaults:
    headers:
      content-type: "application/json"
scenarios:
  - name: "Transactions"
    flow:
      - get:
          url: "/transactions"
          qs:
            limit: 20
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/transactions"
          qs:
            limit: 30
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/transactions"
          qs:
            limit: 100
  - name: "Blocks"
    flow:
      - get:
          url: "/blocks"
          qs:
            limit: 20
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/blocks"
          qs:
            limit: 30
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/blocsks"
          qs:
            limit: 100
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
  - name: "Accounts"
    flow:
      - get:
          url: "/accounts"
          qs:
            limit: 20
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/accounts"
          qs:
            limit: 30
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/accounts"
          qs:
            limit: 100
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
  - name: "Delegates"
    flow:
      - get:
          url: "/accounts"
          qs:
            limit: 20
            isDelegate: true
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/accounts"
          qs:
            limit: 30
            isDelegate: true
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data
      - get:
          url: "/accounts"
          qs:
            limit: 100
            isDelegate: true
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data